import random

from collections import namedtuple

from flask import Flask, render_template, redirect, url_for, request

app = Flask(__name__)
s = 'ав­то­мат, агент, ад­во­кат, акт, ак­тёр, ак­ция, аль­бом, Аме­ри­ка, ам­фи­бия, ан­гел, Ан­глия, ап­па­рат, ' \
    'аре­на, ат­лас, ат­лет, Аф­ри­ка, ба­боч­ка, ба­гет, ба­за, ба­ланс, банк, бан­ка, ба­ня, бар, ба­рак, ' \
    'ба­рьер, бас­сейн, ба­та­рея, Бах, баш­ня, бел­ки, бе­лый, бе­рё­за, Бер­лин, би­лет, бир­жа, бит­ва, блин, ' \
    'блок, боб, бо­е­вик, бокс, бо­лезнь, боль­ни­ца, бом­ба, бо­ров, бор, борт, бо­ти­нок, боч­ка, брак, брев­но, ' \
    'буб­ны, бу­ма­га, бу­тыл­ка, бы­чок, бюст, ва­гон, вал, ведь­ма, век, ве­ли­кан, ве­нец, ве­ра, вер­то­лёт, ' \
    'верфь, вес, вес­на, ве­тер, ве­чер, взгляд, вид, вил­ка, ви­рус, вис­ки, во­да, во­до­лаз, вождь, воз­дух, ' \
    'вой­на, вол­на, во­ля, вор, во­рот, во­ро­та, врач, вре­мя, вы­печ­ка, вы­со­та, вы­ступ­ле­ние, га­вань, газ, ' \
    'га­зель, га­лоп, гвоздь, ге­ний, герб, Гер­ма­ния, ге­рой, ги­гант, глаз, Гол­ли­вуд, го­ло­ва, го­лос, ' \
    'го­лубь, гольф, го­ра, гор­ло, горн, го­род, Горь­кий, град, гра­нат, гра­нит, гре­бень, Гре­ция, гриф, ' \
    'груп­па, гру­ша, гу­ба, губ­ка, гу­се­ни­ца, да­ма, да­ча, двор, двор­ник, день, де­ре­во, дес­на, ди­но­завр, ' \
    'диск, дождь, до­за, док­тор, долг, до­ля, дра­кон, дра­ма, дробь, друж­ба, дуб, ду­ма, ду­хи, ды­ра, дя­тел, ' \
    'Еги­пет, еди­но­рог, ёж, ёл­ка, ёрш, жас­мин, же­ле­зо, жизнь, жи­ла, жу­равль, жу­чок, за­бор, за­вод, ' \
    'за­го­вор, за­кат, за­лив, за­лог, за­мок, за­но­за, за­пад, за­пах, за­яц, звез­да, зво­нок, звук, зеб­ра, ' \
    'зе­лень, зем­ля, зер­но, зи­ма, змей, знак, зо­ло­то, зо­на, зуб, иг­ла, иг­ра, ик­ра, Ин­дия, ин­сти­тут, ' \
    'ин­стру­мент, ирис, ис­кра, ис­точ­ник, ка­ба­чок, ка­би­нет, ка­ва­лер, кадр, ка­зи­но, ка­мень, ка­ме­ра, ' \
    'ка­нал, кант, ка­пи­тан, ка­ра­бин, ка­ра­ул, кар­лик, кар­та, ка­ток, ка­ша, квад­рат, кен­гу­ру, кен­тавр, ' \
    'кет­чуп, ки­ви, ки­но, кисть, кит, Ки­тай, класс, клет­ка, кли­нок, клуб, клык, ключ, кноп­ка, ко­зёл, код, ' \
    'ко­кет­ка, кол, ко­ло­да, ко­лон­ка, ко­лон­на, коль­цо, ко­ман­да, ко­ме­та, ко­нёк, кон­тра­бан­дист, ' \
    'кон­церт, ко­ра, ко­рабль, ко­рень, ко­ро­ва, ко­ро­ле­ва, ко­роль, ко­ро­на, ко­са, кос­мос, кость, ко­стюм, ' \
    'ко­сяк, кот, ко­те­лок, кош­ка, край, кран, кре­пость, крест, кро­вать, кро­ко­дил, кро­лик, кро­на, крош­ка, ' \
    'круг, кры­ло, куб, ку­лак, ку­рорт, курс, куст, лав­ка, лад, ла­дья, ла­зер, ла­ма, лам­па, лас­ка, ле­бедь, ' \
    'лев, ле­ген­да, лёд, лез­вие, лей­ка, лес, ле­то, ли­мон, ли­му­зин, ли­ней­ка, ли­ния, ли­па, лист, ли­цо, ' \
    'ло­же, лож­ка, лом, Лон­дон, ло­пат­ка, лот, ло­шадь, лук, лу­на, луч, лю­бовь, ма­га­зин, мак, ма­ли­на, ' \
    'ма­монт, ман­тия, ман­да­рин, мар­ка, марс, марш, мас­ка, мас­ло, мас­са, ма­стер, мат, ма­ши­на, ма­як, мёд, ' \
    'мед­ведь, ме­лочь, ме­сто, ме­теор, ме­ха­низм, меч, меч­та, мик­ро­скоп, мил­ли­о­нер, ми­на, мир, мо­дель, ' \
    'мо­дуль, мол­ния, моль, мо­ре, мор­ковь, мо­ро­же­ное, Москва, мост, мо­тив, му­зы­ка, му­ка, муш­ка, мышь, ' \
    'мя­та, мяч, на­деж­да, на­лёт, На­по­ле­он, на­ряд, не­бо, не­бо­скрёб, нин­дзя, нит­ка, но­га, нож, но­мер, ' \
    'нор­ка, нос, но­сок, но­та, ночь, ня­ня, обе­зья­на, об­ласть, об­лом, об­раз, об­ра­зо­ва­ние, об­рез, обувь, ' \
    'овал, ов­сян­ка, огонь, ого­род, одеж­да, оке­ан, ок­но, олень, оли­гарх, Олимп, опе­ра, опе­ра­ция, опыт, ' \
    'ор­ган, ор­ден, орёл, орех, осень, ось­ми­ног, отель, отра­ва, охран­ник, оч­ки, па­де­ние, па­ла­та, па­лец, ' \
    'па­лоч­ка, па­на­ма, па­нель, па­ра, па­рад, па­ра­шют, Па­риж, парк, пар­тия, пас­саж, па­трон, па­ук, ' \
    'пач­ка, пе­ре­вод, пе­ре­во­рот, пе­ре­ме­на, пе­рец, пе­ро, пер­чат­ка, пе­чать, пи­ки, пи­ла, пи­лот, ' \
    'пинг­вин, пи­ра­ми­да, пи­рат, пи­сто­лет, пись­мо, Пи­тер, пла­стик, пла­та, плат­фор­ма, пла­тье, плён­ка, ' \
    'плит­ка, плод, плом­ба, пло­щадь, пляж, по­бег, по­бе­да, по­вар, по­гон, по­да­рок, под­ко­ва, подъ­ём, ' \
    'по­езд, по­кров, пол, по­ле, по­лет, по­лис, по­ли­ция, по­ло­са, по­мёт, пом­па, по­ро­да, порт, по­сол, ' \
    'пост, по­ток, поч­ка, по­яс, пра­во, празд­ник, пре­гра­да, пред­ло­же­ние, пред­мет, пресс, пре­ступ­ник, ' \
    'при­бор, при­вод, при­зрак, прин­цес­са, при­ше­лец, про­ба, проб­ка, про­вод, про­вод­ник, про­грам­ма, ' \
    'про­ка­за, про­кат, про­спект, про­филь, пу­те­ше­ствие, путь, Пуш­кин, пя­та­чок, ра­ду­га, раз­вед­чик, ' \
    'раз­вод, раз­во­рот, раз­ряд, рак, ра­ке­та, ра­ко­ви­на, рас­сказ, рас­твор, ре­зи­на, ре­ка, ре­сто­ран, ' \
    'ре­цепт, Рим, риф, ро­бот, рог, род, ро­за, рок, ро­ман, Рос­сия, рот, ро­яль, ртуть, ру­баш­ка, руб­ка, ' \
    'ру­жье, ру­ка, ру­кав, ру­лет­ка, руч­ка, ры­ба, ры­нок, рысь, ры­царь, сад, са­лат, са­лют, са­мо­лет, ' \
    'сан­тех­ник, Са­турн, са­чок, свет, све­ча, сви­де­тель, сек­рет, сек­ция, серд­це, сеть, си­де­ние, си­ла, ' \
    'си­рень, ска­ла, скат, склад, скрип­ка, сла­ва, слон, сме­на, смерть, сна­ряд, снег, сне­го­вик, сни­мок, ' \
    'со­ба­ка, со­ва, со­вет, сол­дат, солн­це, соль, сон, со­став, со­юз, сплав, спорт, спут­ник, сре­да, ссыл­ка, ' \
    'став­ка, ста­ди­он, стан, ста­нок, ствол, стек­ло, сте­на, стой­ка, стол, столб, сто­па, стоп­ка, стра­на, ' \
    'стре­ла, строй, строч­ка, стру­на, сту­дент, стул, сту­пень, судь­ба, су­пер­ге­рой, сфе­ра, схе­ма, счёт, ' \
    'съезд, таз, так­са, такт, та­нец, та­рел­ка, та­ту, те­атр, те­ле­га, те­ле­скоп, те­ле­фон, тень, теп­ло, ' \
    'тех­ни­ка, те­че­ние, тигр, ти­тан, ти­тул, ткань, ток, том, точ­ка, тра­ва, тре­уголь­ник, трой­ка, тру­ба, ' \
    'труд, ту­ба, тур, удар, удар­ник, уда­ча, удел, узел, Урал, уран, ур­на, уро­вень, ут­ка, ут­ко­нос, утро, ' \
    'учё­ный, учи­тель, фа­за, фа­кел, фа­лан­га, фе­никс, фер­ма, фи­га, фин­ка, флей­та, фо­кус, фон­тан, фор­ма, ' \
    'хвост, хло­пок, хо­лод, царь, цве­ток, Це­зарь, центр, цер­ковь, ци­линдр, ча­сти­ца, ча­сы, чер­ви, честь, ' \
    'член, шай­ба, шай­ка, шар, шах, шаш­ка, ши­на, шиш­ка, шка­ла, шко­ла, шо­ко­лад, шпа­гат, шпиль­ка, шпи­он, ' \
    'штат, шу­ба, шум, экран, эле­мент, эльф, эфир, Юпи­тер, юрист, яб­ло­ко, яго­да, яд, яд­ро, язык, якорь, ' \
    'Япо­ния, яс­ли, яч­мень '
s = s.replace('­', '')
s = s.replace(',', '')

Dict = s.split()
Words = []
Colors = []
ran = []
print(len(Dict))
for i in range(25):
    Colors.append(['olive', 'gray', 0])
    ran.append(i)
    a = random.choice(Dict)
    Words.append(a)
    Dict.pop(Dict.index(a))
for i in range(9):
    a = random.choice(ran)
    Colors[a][1] = 'red'
    ran.pop(ran.index(a))
for i in range(8):
    a = random.choice(ran)
    Colors[a][1] = 'navy'
    ran.pop(ran.index(a))
a = random.choice(ran)
Colors[a][1] = 'black'
print(Colors)
q = ['2313']
@app.route('/', methods=['GET'])
def hello_world():
    return render_template('index.html')

@app.route('/captain')
def captain():
    return render_template('Капитан.html', Words=Words,Colors=Colors)

@app.route('/main', methods=['GET'])
def main():
    return render_template('main.html', Words=Words,Colors=Colors)


@app.route('/change00', methods=['POST'])
def change00():
    if(Colors[0][2]==0):
        Colors[0][2]+=1
    return redirect(url_for('main'))

@app.route('/change01', methods=['POST'])
def change01():
    if(Colors[1][2]==0):
        Colors[1][2]+=1
    return redirect(url_for('main'))

@app.route('/change02', methods=['POST'])
def change02():
    if(Colors[2][2]==0):
        Colors[2][2]+=1
    return redirect(url_for('main'))

@app.route('/change03', methods=['POST'])
def change03():
    if(Colors[3][2]==0):
        Colors[3][2]+=1
    return redirect(url_for('main'))

@app.route('/change04', methods=['POST'])
def change04():
    if(Colors[4][2]==0):
        Colors[4][2]+=1
    return redirect(url_for('main'))

@app.route('/change10', methods=['POST'])
def change10():
    if(Colors[5][2]==0):
        Colors[5][2]+=1
    return redirect(url_for('main'))

@app.route('/change11', methods=['POST'])
def change11():
    if(Colors[6][2]==0):
        Colors[6][2]+=1
    return redirect(url_for('main'))

@app.route('/change12', methods=['POST'])
def change12():
    if(Colors[7][2]==0):
        Colors[7][2]+=1
    return redirect(url_for('main'))

@app.route('/change13', methods=['POST'])
def change13():
    if(Colors[8][2]==0):
        Colors[8][2]+=1
    return redirect(url_for('main'))

@app.route('/change14', methods=['POST'])
def change14():
    if(Colors[9][2]==0):
        Colors[9][2]+=1
    return redirect(url_for('main'))

@app.route('/change20', methods=['POST'])
def change20():
    if(Colors[10][2]==0):
        Colors[10][2]+=1
    return redirect(url_for('main'))

@app.route('/change21', methods=['POST'])
def change21():
    if(Colors[11][2]==0):
        Colors[11][2]+=1
    return redirect(url_for('main'))

@app.route('/change22', methods=['POST'])
def change22():
    if(Colors[12][2]==0):
        Colors[12][2]+=1
    return redirect(url_for('main'))

@app.route('/change23', methods=['POST'])
def change23():
    if(Colors[13][2]==0):
        Colors[13][2]+=1
    return redirect(url_for('main'))

@app.route('/change24', methods=['POST'])
def change24():
    if(Colors[14][2]==0):
        Colors[14][2]+=1
    return redirect(url_for('main'))

@app.route('/change30', methods=['POST'])
def change30():
    if(Colors[15][2]==0):
        Colors[15][2]+=1
    return redirect(url_for('main'))

@app.route('/change31', methods=['POST'])
def change31():
    if(Colors[16][2]==0):
        Colors[16][2]+=1
    return redirect(url_for('main'))

@app.route('/change32', methods=['POST'])
def change32():
    if(Colors[17][2]==0):
        Colors[17][2]+=1
    return redirect(url_for('main'))

@app.route('/change33', methods=['POST'])
def change33():
    if(Colors[18][2]==0):
        Colors[18][2]+=1
    return redirect(url_for('main'))

@app.route('/change34', methods=['POST'])
def change34():
    if(Colors[19][2]==0):
        Colors[19][2]+=1
    return redirect(url_for('main'))

@app.route('/change40', methods=['POST'])
def change40():
    if(Colors[20][2]==0):
        Colors[20][2]+=1
    return redirect(url_for('main'))

@app.route('/change41', methods=['POST'])
def change41():
    if(Colors[21][2]==0):
        Colors[21][2]+=1
    return redirect(url_for('main'))

@app.route('/change42', methods=['POST'])
def change42():
    if(Colors[22][2]==0):
        Colors[22][2]+=1
    return redirect(url_for('main'))

@app.route('/change43', methods=['POST'])
def change43():
    if(Colors[23][2]==0):
        Colors[23][2]+=1
    return redirect(url_for('main'))

@app.route('/change44', methods=['POST'])
def change44():
    if(Colors[24][2]==0):
        Colors[24][2]+=1
    return redirect(url_for('main'))


app.run(debug=True)
